INSA-GEI/insa-nxpcup/code/2025-2026/car_control_frdmmcxn236/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D7_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D7_GPIO_PIN 11U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D7_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D7_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D7_PIN 11U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D7_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_10 (coord C3), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D6_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D6_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D6_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D6_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D6_PIN 10U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D6_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_9 (coord B1), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D5_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D5_GPIO_PIN 9U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D5_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D5_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D5_PIN 9U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D5_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_8 (coord A1), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D4_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D4_GPIO_PIN 8U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D4_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D4_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D4_PIN 8U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D4_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_7 (coord A2), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D3_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D3_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D3_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D3_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D3_PIN 7U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D3_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_6 (coord B2), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D2_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D2_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D2_PIN 6U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_5 (coord B3), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D1_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D1_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D1_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D1_PIN 5U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_4 (coord A4), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D0_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D0_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D0_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D0_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D0_PIN 4U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D0_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_18 (coord G4), CAM_PDWN
  @{ */

